import type { Meta, StoryObj } from '@storybook/react';
import PopulationChart, { type ChartData } from '.';
import { type PopulationType } from '@/types/population';

const meta = {
  title: 'ChartSection/Chart',
  component: PopulationChart,
  tags: ['autodocs'],
} satisfies Meta<typeof PopulationChart>;

export default meta;
type Story = StoryObj<typeof meta>;

const data: ChartData = [
  {
    type: 'line',
    name: '長崎県',
    data: [
      1760421, 1641245, 1570245, 1571912, 1590564, 1593968, 1562959, 1544934, 1516523, 1478632, 1426779, 1377187,
      1312317, 1257939, 1192223, 1124291, 1053851, 982200,
    ],
  },
  {
    type: 'line',
    name: '佐賀県',
    data: [
      942874, 871885, 838468, 837674, 865574, 880013, 877851, 884316, 876654, 866369, 849788, 832832, 811442, 784789,
      757242, 728170, 696815, 663781,
    ],
  },
  {
    type: 'line',
    name: '広島県',
    data: [
      2184043, 2281146, 2436135, 2646324, 2739161, 2819200, 2849847, 2881748, 2878915, 2876642, 2860750, 2843990,
      2799702, 2758220, 2689284, 2609116, 2520520, 2428818,
    ],
  },
  {
    type: 'line',
    name: '山口県',
    data: [
      1602207, 1543573, 1511448, 1555218, 1587079, 1601627, 1572616, 1555543, 1527964, 1492606, 1451338, 1404729,
      1342059, 1292809, 1230324, 1165692, 1099619, 1035661,
    ],
  },
  {
    type: 'line',
    name: '沖縄県',
    data: [
      883122, 934176, 945111, 1042572, 1106559, 1179097, 1222398, 1273440, 1318220, 1361594, 1392818, 1433566, 1467480,
      1468236, 1469847, 1465761, 1452321, 1428305,
    ],
  },
  {
    type: 'line',
    name: '福岡県',
    data: [
      4006679, 3964611, 4027416, 4292963, 4553461, 4719259, 4811050, 4933393, 5015699, 5049908, 5071968, 5101556,
      5135214, 5042774, 4955295, 4841878, 4704812, 4554486,
    ],
  },
];

const populationType: PopulationType = '総人口';

const years = [
  '1960',
  '1965',
  '1970',
  '1975',
  '1980',
  '1985',
  '1990',
  '1995',
  '2000',
  '2005',
  '2010',
  '2015',
  '2020',
  '2025',
  '2030',
  '2035',
  '2040',
  '2045',
];

export const Default: Story = {
  args: {
    data,
    populationType,
    years,
  },
};
